# 'brew tap'
# tap "homebrew/cask"
# 'brew tap' with custom Git URL
# tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git"
# 'brew tap' with arguments
# tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git", force_auto_update: true

# set arguments for all 'brew install --cask' commands
# cask_args appdir: "~/Applications", require_sha: true

# 'brew install'
# brew "imagemagick"
# 'brew install --with-rmtp', 'brew services restart' on version changes
# brew "denji/nginx/nginx-full", args: ["with-rmtp"], restart_service: :changed
# 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)
# brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]
# install only on specified OS
# brew "gnupg" if OS.mac?
# brew "glibc" if OS.linux?

# 'brew install --cask'
# cask "google-chrome"
# 'brew install --cask --appdir=~/my-apps/Applications'
# cask "firefox", args: { appdir: "~/my-apps/Applications" }
# bypass Gatekeeper protections (NOT RECOMMENDED)
# cask "firefox", args: { no_quarantine: true }
# always upgrade auto-updated or unversioned cask to latest version even if already installed
# cask "opera", greedy: true
# 'brew install --cask' only if '/usr/libexec/java_home --failfast' fails
# cask "java" unless system "/usr/libexec/java_home", "--failfast"

# 'mas install'
# mas "1Password", id: 443_987_910

# 'whalebrew install'
# whalebrew "whalebrew/wget"

# 'vscode --install-extension'
# vscode "GitHub.codespaces"

# Shell
brew "starship"
brew "zoxide"

# File Manager
brew "joshuto"
# Not quite sold on projectable yet
# tap "dzfrias/formulae"
# brew "dzfrias/formulae/projectable"

# IDE
brew "helix"
brew "lazygit"
brew "git-delta"

# Utilities
brew "fd"                 # find replacement
brew "jq"                 # JSON Parser
brew "rg"                 # grep replacement
brew "sd"                 # sed replacement
brew "yq"                 # YAML Parser
brew "bat"                # cat replacement
brew "eva"                # Simple calculator (bc replacement)
brew "fzf"                # Fuzzy Finder
brew "lsd"                # ls replacement
brew "tldr"               # Quick help docs
brew "tailspin"           # Log Colorizer (tspin)
brew "jless"              # TUI JSON Browser
brew "choose-rust"        # Human-friendly cut/awk alternative
tap "knqyf263/pet"        # CLI Snippets
brew "knqyf263/pet/pet"   # CLI Snippets
# Disabled due to repository being locked?
# tap "xkumiyu/homebrew-case-style-changer"
# brew "case-style-changer" # Quick case changing

# TODO: Move IDE extras to separate brew files

# General Language Servers
# brew "yaml-language-server" Remov

# IDE - Rust
# brew "cargo-binstall"
# brew "cargo-rust-script"

